{
    "v0.1": {
        "new_additions": [
            "Added logging"
        ],
        "fixes": [
            "Fixed the code for commander commands, No more errors or slow run times for finding cards",
            "Fixed set_update to: 1. DISALLOWED users to use this command (Only for Administrators) 2. properly update the updates.json file to properly show updates bot version and sections",
            "Fixed commander_background from causing API issues while fetching cards",
            "Fixed creature from always pulling the same 3 commanders from scryfall",
            "Fixed \"BotUpdates\" to show properly in the $help command window, Also $updates can be used by anyone to check current updates to the bot"
        ],
        "upgrades": [
            "Upgraded all MTG commands to pull images from Scryfall and card data from EDHRec"
        ],
        "notes": [
            "Chat GPT 3.5 Model coming soon, focused on other tasks for the bot"
        ],
        "last_updated_by": "Dabsicle"
    },
    "v0.2": {
        "new_additions": [
            "Added new commands:",
            "$updates - Allows users to see updates and changes (This box youre looking at)",
            "$set_update (Usable only by administrators) - Allows administrators to update the version of the bot with any changes the bot has",
            "$land - Allows users to pick a random fortnite map location to drop at."
        ],
        "fixes": [
            "Fixed the code for commander commands, No more errors or slow run times for finding cards",
            "Fixed set_update to: 1. DISALLOWED users to use this command (Only for Administrators) 2. properly update the updates.json file to properly show updates bot version and sections",
            "Fixed commander_background from causing API issues while fetching cards",
            "Fixed creature from always pulling the same 3 commanders from scryfall",
            "Fixed \"BotUpdates\" to show properly in the $help command window, Also $updates can be used by anyone to check current updates to the bot"
        ],
        "upgrades": [
            "Upgraded all MTG commands to pull images from Scryfall and card data from EDHRec"
        ],
        "notes": [
            "Chat GPT 3.5 Model coming soon, focused on other tasks for the bot"
        ],
        "last_updated_by": "Dabsicle"
    },
    "v0.3": {
        "new_additions": [
            "Added new commands/features:",
            "$chat <message> - Allows you to chat with the Chat GPT 3.5 language model, ask it questions, tell it your name, and itll remember everything!",
            "$history - Your chat history is saved! up to the last 10 messages shown when this command is executed, but your whole conversation is saved",
            "$chatreset - You dont like where your chat is going? Just reset it to get a fresh start!",
            "$stratty - Use this for doing strat roulette in Fortnite! Use the command as is or add [weapon/fun/rat] to generate specific strats! (Will be updated to add more strats)"
        ],
        "fixes": [
            "Fixed Chat GPT not using the correct model",
            "Fixed Chat GPT responses and replying feature"
        ],
        "upgrades": [
            "New Chat GPT language model, using gpt-3.5-turbo instead of text-davinci-002"
        ],
        "notes": [
            "Thinking of commands to add that implement Random Game picker (For people who dont know what game to pick from their steam library)",
            "Will take suggestions, message Dabsicle#8813 with them"
        ],
        "last_updated_by": "Dabsicle"
    },
    "v0.4": {
        "new_additions": [
            "Examples have been added to each command section to ensure $help (command) works properly"
        ],
        "fixes": [
            "BotUpdates no longer shows up for any user other than Dabislce",
            "$set_update, $update - No longer work for any user other than Dabsicle",
            "Changed stratty to no longer use fun or rat, but instead combine them to generate more strats based on choices",
            "Fixed administrative permissions, server specific bot commands now work",
            "Fixed $land to generate true random"
        ],
        "upgrades": [
            "Added new feature to $land - Use $land random to generate a random drop location!",
            "Added new feature to $stratty - Use $stratty (solo/duo/trio/squad) (fun/weapon) to generate strats for fortnite!",
            "Added functionality for $help - Now can ask for details on a specific command! just do $help (command) to get started!"
        ],
        "notes": [
            "Planning on adding Dall-E integration, stay tuned as this will take time.",
            "On waiting list for Chat GPT 4.0 API key, will update when available."
        ],
        "last_updated_by": "Dabsicle"
    },
    "v0.5": {
        "new_additions": [
            "**Games section:** Multiple games have been added to this section, Ive also combined other sections into one, so MTG, Fortnite, and the new Games commands have been implemented and combined.",
            "**$blackjack** - Play a game of blackjack! (Note: Emojis are small, the value will display correctly but its always good to know what cards you have)",
            "**$baccarat** - Play a game of Baccarat! (Note: Emojis are small, the value will display correctly but its always good to know what cards you have)",
            "**Dabcoins** - New coin system for our poker games! There currently isnt a way to earn them at the moment, but feel free to play baccarat with freeplay! (You can bet whatever, its broken, even if you have 0 coins, if you bet 1000, win it, you can bet blackjack, if you lose, youll have a negative balance.)",
            "**Admin cog** - Now admin commands are seperated from regular commands/support commands. Now only Dabsicle can see administrator commands for the bot (unless he keeps help open)"
        ],
        "fixes": [
            "**'$help (command)'** to now properly utilize the examples function. Will now send an example if a command is present when $help is executed."
        ],
        "upgrades": [
            "**Blackjack** now uses a coin system to allow users to bet dabcoins!"
        ],
        "notes": [
            "Will fix baccarat later once a coin earning system is implemented, feel free to earn coins... or lose more than you can have...."
        ],
        "last_updated_by": "Dabsicle"
    },
    "v0.6": {
        "new_additions": [
            "Added slash commands! Now the bot will be using slash commands to execute with discord! This allows users to easily see all the commands they can use and be able to streamline the command use process with the bot!"
        ],
        "fixes": [],
        "upgrades": [],
        "notes": [],
        "last_updated_by": "thcraze",
        "last_updated_time": "July 01, 2024 05:17 PM PDT"
    },
    "v0.7": {
        "new_additions": [
            "Added /games fortnitedrop ; This command will display a random named location on the most recent Fortnite map (Most recent chapter/season) where the bot recommends you drop! Try it out!",
            "Added a new command. \"/games meme\" will generate a random meme image! Have fun!",
            "Added a Purge option for admins. this command will allow the user to purge either: Bot messages or User messages. Purging will delete messages from a specific timeframe (aka Purge from now to 7/1)",
            "Added DND commands! For now theres 2 commands /dnd roll and /dnd notes. Allowing you to roll dice with advantage disadvantage or a normal roll. Also being able to keep track of your campaign notes easily! Check them out!"
        ],
        "fixes": [
            "Time will now properly be saved in PDT instead of UTC"
        ],
        "upgrades": [],
        "notes": [
            "If youd like to submit a suggestion (Either add to the bot or change something about the bot) Feel free to use the <#1258601984009834537> channel to suggest something!",
            "Looking at add chat GPT back into the bot. Will add functionality once the bot can properly communicate, retain history, and also conversate with the user"
        ],
        "last_updated_by": "thcraze",
        "last_updated_time": "July 08, 2024 02:50 PM PDT"
    },
    "v0.8": {
        "new_additions": [
            "Added Daily Rewards for dabcoins.",
            "Added functions to MTG for deck creation and card search.",
            "Added Lottery! do /games Buyticket to purchase a lottery ticket! Drawings are 6 PM PST",
            "Added a new game! Spinner for a chance to win big coins!",
            "Added Jackpot! use the command to get your chance to win big coins! The jackpot updates every hour, check the balance today!"
        ],
        "fixes": [
            "Fixed issue with time display and timezone.",
            "Fixed usage of dabcoins on coinflip.",
            "Updates dabcoins for more versitility."
        ],
        "upgrades": [
            "Removed Birthdays, DnD, and casino games.",
            "Fixed issues with time display.",
            "Fixed bot operation speed.",
            "Upgraded functionality with Help command. Better Interface for Commands."
        ],
        "notes": [
            "I haven't been active with bot development, Trying to get out of my creative slump. Thanks for using the bot :)",
            "Changed format of versions in updates"
        ],
        "last_updated_by": "thcraze",
        "last_updated_time": "November 27, 2024 11:51 AM PST"
    }
}